{
    "title":"Rejected Canada Visa",
    "subTitle":"Rejected Visitor Visa, Rejected Super Visa, Rejected Business Visitor Visa, Rejected Transit Visa, Rejected Study Permit, Rejected Temporary Resident Permit (TRP) for Canada. We can help you to overcome your rejection.",
    "description":"Rejection of visa is certainly a bad news. But no worries, we have a solution for that.So you recently had your visa rejected or you know someone whose visa got rejected. You got rejected visitor visa or, rejected student visa, rejected tourist visa, rejected transit visa, or possibly that your girlfriend, or spouse got rejected visitor visa, or your parents or grandparents’ got their super visa rejected or visitor visa rejected. It’s highly possible that you might have got Canada visa rejected after medicals or due to the purpose of visit, travel history or due to personal assets. Maybe you have tried to reapply and your visa got rejected again.Just like you need a doctor to look after health issues, you need an authorized immigration consultant to look into immigration problem deeper. Just like doctor give you medicine to solve health issues, immigration consultant can understand the problem and give you a recommendation for next steps to overcome your immigration problems. Professionals can help you secure your, your partners’, your relatives’ or your parents' dream to come to Canada and make it a reality.Connect to us for fore one-one consultation to know more.",
    "listCount":1,
    "list":[
        {
            "title":"Below is a list of things you need to do if your visa is rejected.",
            "content":
            [
                "Talk immediately to authorized immigration consultant or lawyer, or paralegals (only in Ontario). They are the authorized person to give immigration advice.",
                "Request them to get reasons for refusals. An immigration officer from Canada Visa Office write their notes in CAIPS/GCMS system. Immigration professionals can retrieve this information. This information is made available to representatives as per the Access to Information Act (ATI).",
                "Seek immigration advice: Immigration consultants can analyze the notes and then help you to make your visitor visa stronger by addressing the officer’s issue.",
                "Wait for results: Next steps is to wait for the results."

            ]
        }
    ]

}